from src.utils import function_for_showing


def test_executed_operations():
    assert function_for_showing(dictionary=dict) == print(f"2019.12.08 Открытие вклада\nСчет **5907\n41096.24 USD\n"
                                                          f'\n2019.12.07 Перевод организации\n2019.12.07 Перевод '
                                                          f'организации\n'
                                                          f'Visa Classic 2842 87** **** 9012 --> Счет '
                                                          f'**3655\n48150.39 USD\n'
                                                          f'\n2019.11.19 Перевод организации\n'
                                                          f'Maestro 7810 84** **** 5568 --> Счет **2869\n30153.72'
                                                          f' руб.\n'
                                                          f'\n2019.11.13 Перевод со счета на счет\n'
                                                          f'Счет **9794 --> Счет **8125\n62814.53 руб.\n'
                                                          f'\n2019.11.05 Открытие вклада\nСчет **8381\n21344.35 руб.')
